Revit 2024 API
UIApplication.IsViewerModeActive Property
 Determines if Revit session is in Viewer mode.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public bool IsViewerModeActive { get; }
Visual Basic
Public ReadOnly Property IsViewerModeActive As Boolean
	Get
Visual C++
public:
property bool IsViewerModeActive {
	bool get ();
}
See Also
UIApplication Class
Autodesk.Revit.UI Namespace